# Виселица
#
# Классическая игра виселица. Компьютер случайным образом выбирает слово,
# которое игрок должен отгадать буква за буквой
# Если грок не сумеет отгадать за отведенное число попыток, на экране появится фигурка повешенного человечка

import random

# константы
HANGMAN = (
'''
 ------
 |    |
 |
 |
 |
 |
 |
 |
 |
------------
'''
,
'''
 ------
 |    |
 |    0 |
 |
 |
 |
 |
 |
 |
------------
'''
,
'''
 ------
 |    |
 |    0 |  -+-
 |
 |
 |
 |
 |
 |
------------
'''
,
'''
 ------
 |    |
 |    0 |  /-+-
 |
 |
 |
 |
 |
 |
------------
'''
,
'''
 ------
 |    |
 |    0 |  /-+-/
 |
 |
 |
 |
 |
 |
------------
'''
,
'''
 ------
 |    |
 |    0 |  /-+-/
 |    |
 |
 |
 |
 |
 |
------------
'''
,
'''
 ------
 |    |
 |    0 |  /-+-/
 |    |
 |    |
 |
 |
 |
 |
------------
'''
,
'''
 ------
 |    |
 |    0 |  /-+-/
 |    |
 |    |
 |   |
 |   |
 |
 |
------------
'''
,
'''
 ------
 |    |
 |    0 |  /-+-/
 |    |
 |    |
 |   | |
 |   | |
 |
 |
------------
''')
MAX_WRONG = len(HANGMAN) - 1
WORDS = ('ЗЕМЛЯ', 'НЕБО', 'ЖОПА', 'АКВАРИУМ', 'ПЕСЕНКА')

word = random.choice(WORDS)
so_far = '-'* len(word)
wrong = 0
used = []

print('Добро пожаловать в игру "Виселица". Удачи вам!')
while wrong < MAX_WRONG and so_far != word:
    print(HANGMAN[wrong])
    print('\nВы уже предлагали следующие буквы:\n', used)
    print('\nОтгаданное вами в слове сейчас выглядит так:\n', so_far)
    guess = input('\n\nВведите букву: ')
    guess = guess.upper()
    while guess in used:
        print('Вы уже предлагали букву', guess)
        guess = input('\n\nВведите букву: ')
        guess = guess.upper()
    used.append(guess)
    if guess in word:
        print('Да буква', guess,  'есть в слове')
        new = ''
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new
    else:
        print('К сожалению буквы', guess, 'нет в слове')
        wrong += 1
    if wrong == MAX_WRONG:
        print(HANGMAN[wrong])
        print('\nВас повесили')
    else:
        print('\nВы отгадали')
        print('Было загадано слово', word)
input('\n Нажмите Enter чтобы выйти')